Revit 2027 API
ParameterTypeId.FabricationPartDiameterOutOption Property
 "Main Secondary Diameter Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDiameterOutOption { get; }
Public Shared ReadOnly Property FabricationPartDiameterOutOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDiameterOutOption {
	ForgeTypeId^ get ();
}
static member FabricationPartDiameterOutOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace